artillery.yml
config:
  target: 'http://localhost:8081'
  phases:
    - duration: 60
      arrivalRate: 1000
scenarios:
  - flow:
    - get:
        url: "/api/houses/{{$randomNumber(1,100)}}"
    # - get:
    #     url: "/api/houses/{{$randomNumber(1,10000000)}}"
    - get:
        url: "/api/agents?premier=true&zip={{$randomNumber(10000,10100)}}"
    # - get:
    #     url: "/api/agents?premier=true&zip={{$randomNumber(10000,99999)}}"